{
  "alley": {
    "name": "کوی معلم  ",
    "code": "1404/05/31",
    "area": " 51 ",
    "population": "8,600 ",
    "rate": "4.7"
  },
  "location": "محله کوی معلم در بخش مرکزی‌ـ‌غربی شهر بجنورد قرار دارد. این محله از شمال با میدان توحید و بلوار شهدا، از شرق با خیابان صیاد شیرازی، از جنوب با چهارراه صیاد شیرازی، خیابان طالقانی غربی و میدان قائم، و از غرب با بلوار جانباز هم‌جوار است. همچنین با محلات ارتش، شیرآب و مصلی مجاورت دارد. موقعیت آن، ارتباط مؤثر با بخش‌های مرکزی و غربی شهر را فراهم کرده است.",
  "history": "کوی معلم در گذشته ، به‌عنوان منطقه‌ای با کاربری باغات و زمین‌های کشاورزی شناخته میشد؛ با توسعه شهر بجنورد و افزایش نیاز به فضاهای مسکونی، این منطقه به‌تدریج به محله‌ای مسکونی تبدیل شد. در ابتدا، این محله برای اسکان فرهنگیان و کارکنان آموزش و پرورش طراحی شد و به همین دلیل به «کوی معلم» معروف گردید. در سال‌های اخیر، کوی معلم با رشد سریع جمعیتی و توسعه زیرساخت‌های شهری مواجه بوده است , به یکی از مناطق مهم شهری تبدیل شده است. ",
  "physicalAnalysis": "",

  "functionalAnalysis": "",
  "accessability": " ",
  "overallAnalysis": "",
  "qualities": {
    "security": "",
    "vitality": "",
    "accessability": "",
    "quality": "",
    "greenSpace": "",
    "trafic": ""
  },
  "priorities": [
    {
      "title": "نوسازی بافت فرسوده",
      "context": "تمرکز بر املاک ۳۰ تا ۵۰ ساله و غیرقابل سکونت برای مشارکت در ساخت."
    },
    {
      "title": "خرید زمین‌های بایر ",
      "context": ": وجود تعداد قابل توجهی زمین بایر آماده ساخت ؛ مناسب برای آغاز پروژه‌های جدید و کوچک‌مقیاس."
    },
    {
      "title": "خرید ملک ",
      "context": "به دلیل موقعیت مناسب محله  و ارزش بالا و رو به افزایش املاک در محله ریسک سرمایه‌گذاری در این محله پایین ارزیابی می‌شود"
    },
    {
      "title": "",
      "context": ""
    }
  ],
  "conclusion": "",
  "prosAndCons": [
    {
      "strengths": "دسترسی مناسب به مراکز خدماتی  و دولتی",
      "weaknesses": "عرض  کم معابر فرعی ",
      "opportunities": "پتانسیل  بالای مشارکت در ساخت و نوسازی خانه های فرسوده",
      "threats": "فرسودگی بخشی از املاک با قدمت بالا به مرور زمان "
    },
    {
      "strengths": "وجود امکانات شهری در محله ",
      "weaknesses": "وجود بافت قدیمی و فرسوده در کنار ساختمان های جدید",
      "opportunities": "فرصت ساخت و ساز در بخش ساخته نشده (مرز شرقی محله) ",
      "threats": "شلوغی و ترافیک در محله در ساعات تعطیلی مدارس"
    },
    {
      "strengths": "آرامش و آسایش در محله  ",
      "weaknesses": ".",
      "opportunities": "فرصت افزایش کیفیت معابر (سواره و پیاده)  خصوصا در معابر محلی",
      "threats": "به دلیل ارتفاع  و قدمت نا متوازن ساختمان ها ،امکان از بین رفتن نظم بصری در این محله وجود دارد"
    }
  ]
  
}
